# Lesson 3
### Questions
1. Add chunk of code to beginning of notebook.
2. Use basic Python operators to find the number of seconds in the month of June. Find the number of seconds that have lapsed between 1 June at noon and 14 Aug, 9:30 AM.
3. Import a table (‘world_population.csv’) and find:
a. The population in 2015 (the dataset begins at 1950).
b. The population growth between 1950 and 2015.
c. The average annual growth rate over the course of the dataset.
4. The ‘Titanic’ dataset describes passengers on the Titanic when it sank. Import this dataset and answer the following questions:
a. Relabel the ‘Pclass’ column to ‘passenger_class’.
b. Create a new column ‘family_size’ that adds the number of siblings/spouses, ‘SibSp’, to the number of children, ‘Parch’.
c. Create a barplot of number of passengers, broken down by passenger class.
HINT: you will need to use the group method on the dataset; for more info, see the datascience package help.
d. Sort the data by age and show the youngest 5 passengers.
e. Now sort by age from oldest to youngest and show the oldest 5 passengers.
What did you notice? Eliminate these “nan” values and try again.
f. Find the survival rate for passengers of the Titanic, broken down by passenger class. (HINT: select the columns you care about and then apply the group method, summarizing with the mean.)
g. Now that you have some familiarity with the dataset, create two of your own questions and answer them.

### Responses

In [11]:
#1. This was the chunk of code that we were told to load in (I should be careful as I could be loading in a virus).
import numpy as np
from datascience import *
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action="ignore", category=FutureWarning)

In [12]:
#2. By taking the days in june multiplying that by hours in a day, minutes in an hour, and seconds in a minute, we get the
# number of seconds in June.
seconds_in_june=30*24*60*60

# By taking the number of days between June 1st and August 14th multiplying that by hours in a day, minutes in an hour, and
# seconds in a minute, then subtract off the 2.5 hour time difference between 12pm and 9:30 am.
lapsed_seconds=74*24*60*60-2.5*60*60
print(seconds_in_june)
print(lapsed_seconds)

2592000
6384600.0

In [23]:
#3a. I load in the table and datascience package and take the 66 entry (index=65) to gain the population in 2015
from datascience import *
population = Table.read_table("world_population.csv").column("Population")
population_in_2015 = population.item(65)
print(population_in_2015)

7256490011

In [22]:
#b. The increase in population from 1950 to 2015 is the diffence between the population of index 65 and index 0.
population_difference=population.item(65)-population.item(0)
print(population_difference)

4698861357

In [ ]:
#c. The average growth in a year is found by dividing the diffence from b by the year difference (65 years).
average_growth=population_difference/65
print(average_growth)

In [26]:
#4. Loading in the data set
Titanic=Table.read_table("Titanic.csv")
Titanic

PassengerId | Survived | Pclass | Name                                                | Sex    | Age  | SibSp | Parch | Ticket           | Fare    | Cabin | Embarked
1           | 0        | 3      | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | A/5 21171        | 7.25    | nan   | S
2           | 1        | 1      | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | PC 17599         | 71.2833 | C85   | C
3           | 1        | 3      | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | STON/O2. 3101282 | 7.925   | nan   | S
4           | 1        | 1      | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 113803           | 53.1    | C123  | S
5           | 0        | 3      | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 373450           | 8.05    | nan   | S
6           | 0        | 3      | Moran, Mr. James                                    | male   | nan  | 0     | 0     | 330877           | 8.4583  | nan   | Q
7           | 0        | 1      | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 17463            | 51.8625 | E46   | S
8           | 0        | 3      | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 349909           | 21.075  | nan   | S
9           | 1        | 3      | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 347742           | 11.1333 | nan   | S
10          | 1        | 2      | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 237736           | 30.0708 | nan   | C
... (881 rows omitted)

In [27]:
#a. Using the relabel command, I relabelled the Pclass column to passenger_class
Titanic.relabel("Pclass","passenger_class")

PassengerId | Survived | passenger_class | Name                                                | Sex    | Age  | SibSp | Parch | Ticket           | Fare    | Cabin | Embarked
1           | 0        | 3               | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | A/5 21171        | 7.25    | nan   | S
2           | 1        | 1               | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | PC 17599         | 71.2833 | C85   | C
3           | 1        | 3               | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | STON/O2. 3101282 | 7.925   | nan   | S
4           | 1        | 1               | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 113803           | 53.1    | C123  | S
5           | 0        | 3               | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 373450           | 8.05    | nan   | S
6           | 0        | 3               | Moran, Mr. James                                    | male   | nan  | 0     | 0     | 330877           | 8.4583  | nan   | Q
7           | 0        | 1               | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 17463            | 51.8625 | E46   | S
8           | 0        | 3               | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 349909           | 21.075  | nan   | S
9           | 1        | 3               | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 347742           | 11.1333 | nan   | S
10          | 1        | 2               | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 237736           | 30.0708 | nan   | C
... (881 rows omitted)

In [30]:
#b. I am creating the array of the size of each family and then using the with_column command to add it to the Table
family_size=Titanic.column("SibSp")+Titanic.column("Parch")
Titanic.with_column("family_size",family_size)

PassengerId | Survived | passenger_class | Name                                                | Sex    | Age  | SibSp | Parch | Ticket           | Fare    | Cabin | Embarked | family_size
1           | 0        | 3               | Braund, Mr. Owen Harris                             | male   | 22   | 1     | 0     | A/5 21171        | 7.25    | nan   | S        | 1
2           | 1        | 1               | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female | 38   | 1     | 0     | PC 17599         | 71.2833 | C85   | C        | 1
3           | 1        | 3               | Heikkinen, Miss. Laina                              | female | 26   | 0     | 0     | STON/O2. 3101282 | 7.925   | nan   | S        | 0
4           | 1        | 1               | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female | 35   | 1     | 0     | 113803           | 53.1    | C123  | S        | 1
5           | 0        | 3               | Allen, Mr. William Henry                            | male   | 35   | 0     | 0     | 373450           | 8.05    | nan   | S        | 0
6           | 0        | 3               | Moran, Mr. James                                    | male   | nan  | 0     | 0     | 330877           | 8.4583  | nan   | Q        | 0
7           | 0        | 1               | McCarthy, Mr. Timothy J                             | male   | 54   | 0     | 0     | 17463            | 51.8625 | E46   | S        | 0
8           | 0        | 3               | Palsson, Master. Gosta Leonard                      | male   | 2    | 3     | 1     | 349909           | 21.075  | nan   | S        | 4
9           | 1        | 3               | Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)   | female | 27   | 0     | 2     | 347742           | 11.1333 | nan   | S        | 2
10          | 1        | 2               | Nasser, Mrs. Nicholas (Adele Achem)                 | female | 14   | 1     | 0     | 237736           | 30.0708 | nan   | C        | 1
... (881 rows omitted)

In [52]:
#c.
Count_array=make_array(np.char.count(str(Titanic.column("passenger_class")),"1"),
                       np.char.count(str(Titanic.column("passenger_class")),"2"),
                       np.char.count(str(Titanic.column("passenger_class")),"3"))
Array=Table.with_columns("Class",make_array(1,2,3),"Count",Count_array)
Array

AssertionError: incorrect columns format

In [53]:
#d.
Titanic.sort("Age")

PassengerId | Survived | passenger_class | Name                            | Sex    | Age  | SibSp | Parch | Ticket  | Fare    | Cabin   | Embarked
804         | 1        | 3               | Thomas, Master. Assad Alexander | male   | 0.42 | 0     | 1     | 2625    | 8.5167  | nan     | C
756         | 1        | 2               | Hamalainen, Master. Viljo       | male   | 0.67 | 1     | 1     | 250649  | 14.5    | nan     | S
470         | 1        | 3               | Baclini, Miss. Helene Barbara   | female | 0.75 | 2     | 1     | 2666    | 19.2583 | nan     | C
645         | 1        | 3               | Baclini, Miss. Eugenie          | female | 0.75 | 2     | 1     | 2666    | 19.2583 | nan     | C
79          | 1        | 2               | Caldwell, Master. Alden Gates   | male   | 0.83 | 0     | 2     | 248738  | 29      | nan     | S
832         | 1        | 2               | Richards, Master. George Sibley | male   | 0.83 | 1     | 1     | 29106   | 18.75   | nan     | S
306         | 1        | 1               | Allison, Master. Hudson Trevor  | male   | 0.92 | 1     | 2     | 113781  | 151.55  | C22 C26 | S
165         | 0        | 3               | Panula, Master. Eino Viljami    | male   | 1    | 4     | 1     | 3101295 | 39.6875 | nan     | S
173         | 1        | 3               | Johnson, Miss. Eleanor Ileen    | female | 1    | 1     | 1     | 347742  | 11.1333 | nan     | S
184         | 1        | 2               | Becker, Master. Richard F       | male   | 1    | 2     | 1     | 230136  | 39      | F4      | S
... (881 rows omitted)

In [55]:
#e.
Titanic.sort("Age",descending=True)

PassengerId | Survived | passenger_class | Name                                         | Sex    | Age  | SibSp | Parch | Ticket     | Fare    | Cabin | Embarked
889         | 0        | 3               | Johnston, Miss. Catherine Helen "Carrie"     | female | nan  | 1     | 2     | W./C. 6607 | 23.45   | nan   | S
879         | 0        | 3               | Laleff, Mr. Kristo                           | male   | nan  | 0     | 0     | 349217     | 7.8958  | nan   | S
869         | 0        | 3               | van Melkebeke, Mr. Philemon                  | male   | nan  | 0     | 0     | 345777     | 9.5     | nan   | S
864         | 0        | 3               | Sage, Miss. Dorothy Edith "Dolly"            | female | nan  | 8     | 2     | CA. 2343   | 69.55   | nan   | S
860         | 0        | 3               | Razi, Mr. Raihed                             | male   | nan  | 0     | 0     | 2629       | 7.2292  | nan   | C
850         | 1        | 1               | Goldenberg, Mrs. Samuel L (Edwiga Grabowska) | female | nan  | 1     | 0     | 17453      | 89.1042 | C92   | C
847         | 0        | 3               | Sage, Mr. Douglas Bullen                     | male   | nan  | 8     | 2     | CA. 2343   | 69.55   | nan   | S
840         | 1        | 1               | Marechal, Mr. Pierre                         | male   | nan  | 0     | 0     | 11774      | 29.7    | C47   | C
838         | 0        | 3               | Sirota, Mr. Maurice                          | male   | nan  | 0     | 0     | 392092     | 8.05    | nan   | S
833         | 0        | 3               | Saad, Mr. Amin                               | male   | nan  | 0     | 0     | 2671       | 7.2292  | nan   | C
... (881 rows omitted)